<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"c2d6e06fe245114710df5a6190e5fb5ac532f0be7b3ef98a06504bfccd1e35c7","plan_job_ref":"Job Test actions using target and replace #456 at https://github.com/dflook/terraform-github-actions/actions/runs/13545842872","plan_out_hash":"c038934c4ba1aee5c4fe361d79f7dec04a2a09916f4fc57fa53d0e819d26628c","plan_hash":"1647b67045207074c8c8fe66d95d27ef91c0260217a352c7294fdec7ece695f5","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "jwjTljPmkM" -> (known after apply)
!~  foreach = "Xc0UREgdID" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #456](https://github.com/dflook/terraform-github-actions/actions/runs/13545842872)